<HTML>
<HEAD>
<TITLE>ВСЕ О КОМПЬЮТЕРЕ</TITLE>
</HEADE>
<P ALIGN="left">
<P ALIGN="right">
<P ALIGN="center">
[<A HREF="tex.htm">Тех.Поддержка</A>]  [<A HREF="owner.htm">Создатель</A>]  [<A HREF="pochta.htm">Отзыв</A>]
</P>
</HTML
<FONT COLOR-"blue">
<H1 ALIGN="center">
ВСЕ О КОМПЬЮТЕРЕ
</H1>
</FONT>
<HR>
<H1 ALIGN="left">
<FONT COLOR="red">
Содержание
<IMG SRC="Fail.jpg" align="right">
</FONT>
</H1>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">УСТРОЙСТВО КОМПЬЮТЕРА</A>
</ADRESS>
</H4>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">СИСТЕМНЫЙ БЛОК</A>
</ADRESS>
</H4>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">МАТЕРИНСКАЯ ПЛАТА</A>
</ADRESS>
</H4>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">ПРОЦЕССОР</A>
</ADRESS>
</H4>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">МИКРОСХЕМА ПЗУ И СИСТЕМА BIOS</A>
</ADRESS>
</H4>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">ЭНЕРГОНЕЗАВИСИМАЯ ПАМЯТЬ CMOS</A>
</ADRESS>
</H4>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">ЖЕСТКИЙ ДИСК</A>
</ADRESS>
</H4>
<H2 ALIGN="left">
<ADRESS>
<A HREF="mailto:username@server.ru">ДИСКОВОД КОМПАКТ-ДИСКОВ CD-ROM</A>
</ADRESS>
</H4>
</H2>
<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Устройство компьютера
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
Персональный компьютер - универсальная техническая система.
Его конфигурацию (состав оборудования) можно гибко изменять по мере необходимости.
Тем не менее, существует понятие базовой конфигурации, которую считают типовой. В таком комплекте компьютер обычно поставляется.
Понятие базовой конфигурации может меняться.
В настоящее время в базовой конфигурации рассматривают четыре устройства:
</H5>
<IMG SRC="Fail2.jpg" align="center">
<UL TYPE="square">
<LI> системный блок;
<LI> монитор;
<LI> клавиатуру;
<LI> мышь.
</LI>
</OL>
<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Системный блок
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
Системный блок представляет собой основной узел, внутри которого установлены наиболее важные компоненты.
 Системный блок
Устройства, находящиеся внутри системного блока, называют внутренними, а устройства, подключаемые к нему снаружи, называют внешними.
Внешние дополнительные устройства, предназначенные для ввода, вывода и длительного хранения данных, также называют периферийными.
</H5>
<IMG SRC="Fail3.jpg" align="center">
<IMG SRC="Fail4.jpg" align="center">
<IMG SRC="Fail12.jpg" align="center">
<UL TYPE="square">
<LI> системный блок;
<LI> монитор;
<LI> клавиатуру;
<LI> мышь.
</LI>
</OL>

<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Материнская плата
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
Материнская плата (mother board) - основная плата персонального компьютера, представляющая из себя лист стеклотекстолита, покрытый медной фольгой.
Путем травления фольги получают тонкие медные проводники соединяющие электронные компоненты.
На материнской плате размещаются:
</H5>
<IMG SRC="Fail5.jpg" align="center">
<H5 ALIGN="center">
процессор - основная микросхема, выполняющая большинство математических и логических операций;
шины - наборы проводников, по которым происходит обмен сигналами между внутренними устройствами компьютера;
оперативная память (оперативное запоминающее устройство, ОЗУ) - набор микросхем, предназначенных для временного хранения данных, когда компьютер включен;
ПЗУ (постоянное запоминающее устройство) - микросхема, предназначенная для длительного хранения данных, в том числе и когда компьютер выключен;
микропроцессорный комплект (чипсет) - набор микросхем, управляющих работой внутренних устройств компьютера и определяющих основные функциональные возможности материнской платы;
разъемы для подключения дополнительных устройств (слоты).
</H5>
</OL>

<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Процессор
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
Процессор (микропроцессор, центральный процессор, CPU) - основная микросхема компьютера, в которой и производятся все вычисления.
Он представляет из себя большую микросхему, которую можно легко найти на материнской плате.
</H5>
<IMG SRC="Fail6.jpg" align="center">
<H5 ALIGN="center">
На процессоре устанавливается большой медный ребристый радиатор, охлаждаемый вентилятором.
</H5>
<IMG SRC="Fail7.jpg" align="center">
<H5 ALIGN="center">
Конструктивно процессор состоит из ячеек, в которых данные могут не только храниться, но и изменяться.
Внутренние ячейки процессора называют регистрами.
Важно также отметить, что данные, попавшие в некоторые регистры, рассматриваются не как данные, а как команды, управляющие обработкой данных в других регистрах.
Среди регистров процессора есть и такие, которые в зависимости от своего содержания способны модифицировать исполнение команд. Таким образом, управляя засылкой данных в разные регистры процессора, можно управлять обработкой данных.
На этом и основано исполнение программ.
С остальными устройствами компьютера, и в первую очередь с оперативной памятью, процессор связан несколькими группами проводников, называемых шинами.
Основных шин три:
</H5>
<UL TYPE="square">
<LI> АДРЕСНАЯ ШИНА
<LI> ШИНА ДАННЫХ
<LI> ШИНА КОМАНД
</LI>
</OL>

<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Оперативная память
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
Оперативная память (RAM - Random Access Memory) - это массив кристаллических ячеек, способных хранить данные.
</H5>
<IMG SRC="Fail8.gif" align="center">
<H5 ALIGN="center">
Существует много различных типов оперативной памяти, но с точки зрения физического принципа действия различают динамическую память (DRAM) и статическую память (SRAM).
Ячейки динамической памяти (DRAM) можно представить в виде микроконденсаторов, способных накапливать заряд на своих обкладках.
Это наиболее распространенный и экономически доступный тип памяти.
Недостатки этого типа связаны, во-первых, с тем, что как при заряде, так и при разряде конденсаторов неизбежны переходные процессы, то есть запись данных происходит сравнительно медленно.
Второй важный недостаток связан с тем, что заряды ячеек имеют свойство рассеиваться в пространстве, причем весьма быстро.
Если оперативную память постоянно не «подзаряжать», утрата данных происходит через несколько сотых долей секунды.
Для борьбы с этим явлением в компьютере происходит постоянная регенерация (освежение, подзарядка) ячеек оперативной памяти.
Регенерация осуществляется несколько десятков раз в секунду и вызывает непроизводительный расход ресурсов вычислительной системы.
Ячейки статической памяти (SRAM) можно представить как электронные микроэлементы - триггеры, состоящие из нескольких транзисторов.
В триггере хранится не заряд, а состояние (включен/выключен), поэтому этот тип памяти обеспечивает более высокое быстродействие, хотя технологически он сложнее и, соответственно, дороже.
Микросхемы динамической памяти используют в качестве основной оперативной памяти компьютера.
Микросхемы статической памяти используют в качестве вспомогательной памяти (так называемой кэш-памяти), предназначенной для оптимизации работы процессора.
Каждая ячейка памяти имеет свой адрес, который выражается числом.
Одна адресуемая ячейка содержит восемь двоичных ячеек, в которых можно сохранить 8 бит, то есть один байт данных.
Таким образом, адрес любой ячейки памяти можно выразить четырьмя байтами.
Оперативная память в компьютере размещается на стандартных панельках, называемых модулями.
Модули оперативной памяти вставляют в соответствующие разъемы на материнской плате.
Конструктивно модули памяти имеют два исполнения - однорядные (SIMM-модули) и двухрядные (DIMM-модули).
Основными характеристиками модулей оперативной памяти являются объем памяти и время доступа.
Время доступа показывает, сколько времени необходимо для обращения к ячейкам памяти - чем оно меньше, тем лучше. Время доступа измеряется в миллиардных долях секунды (наносекундах, нс).
</H5>
</OL>

<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Микросхема ПЗУ и система BIOS
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
В момент включения компьютера в его оперативной памяти нет ничего - ни данных, ни программ, поскольку оперативная память не может ничего хранить без подзарядки ячеек более сотых долей секунды, но процессору нужны команды, в том числе и в первый момент после включения.
Поэтому сразу после включения на адресной шине процессора выставляется стартовый адрес.
Это происходит аппаратно, без участия программ (всегда одинаково).
Процессор обращается по выставленному адресу за своей первой командой и далее начинает работать по программам.
Этот исходный адрес не может указывать на оперативную память, в которой пока ничего нет.
Он указывает на другой тип памяти - постоянное запоминающее устройство (ПЗУ).
Микросхема ПЗУ способна длительное время хранить информацию, даже когда компьютер выключен.
Программы, находящиеся в ПЗУ, называют «зашитыми» - их записывают туда на этапе изготовления микросхемы.
Комплект программ, находящихся в ПЗУ, образует базовую систему ввода-вывода (BIOS - Basic Input Output System).
</H5>
<IMG SRC="Fail9.jpg" align="center">
<H5 ALIGN="center">
Основное назначение программ этого пакета состоит в том, чтобы проверить состав и работоспособность компьютерной системы и обеспечить взаимодействие с клавиатурой, монитором, жестким диском и дисководом гибких дисков.
Программы, входящие в BIOS, позволяют нам наблюдать на экране диагностические сообщения, сопровождающие запуск компьютера, а также вмешиваться в ход запуска с помощью клавиатуры.
</H5>
</OL>

<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Жесткий диск
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
Жесткий диск - основное устройство для долговременного хранения больших объемов данных и программ.
На самом деле это не один диск, а группа соосных дисков, имеющих магнитное покрытие и вращающихся с высокой скоростью.
</H5>
<IMG SRC="Fail10.jpg" align="center">
<H5 ALIGN="center">
Таким образом, этот «диск» имеет не две поверхности, как должно быть у обычного плоского диска, а 2n поверхностей, где n - число отдельных дисков в группе.
Над каждой поверхностью располагается головка, предназначенная для чтения-записи данных.
При высоких скоростях вращения дисков (90 об/с) в зазоре между головкой и поверхностью образуется аэродинамическая подушка, и головка парит над магнитной поверхностью на высоте, составляющей несколько тысячных долей миллиметра.
При изменении силы тока, протекающего через головку, происходит изменение напряженности динамического магнитного поля в зазоре, что вызывает изменения в стационарном магнитном поле ферромагнитных частиц, образующих покрытие диска.Так осуществляется запись данных на магнитный диск.
Операция считывания происходит в обратном порядке.
Намагниченные частицы покрытия, проносящиеся на высокой скорости вблизи головки, наводят в ней ЭДС самоиндукции.
Электромагнитные сигналы, возникающие при этом, усиливаются и передаются на обработку.
Управление работой жесткого диска выполняет специальное аппаратно-логическое устройство - контроллер жесткого диска.
В настоящее время функции контроллеров дисков выполняют микросхемы, входящие в микропроцессорный комплект (чипсет), хотя некоторые виды высокопроизводительных контроллеров жестких дисков по-прежнему поставляются на отдельной плате.
К основным параметрам жестких дисков относятся емкость и производительность.
</H5>
</OL>

<body>
<H1 ALIGN="center">
<FONT COLOR="blue">
Дисковод компакт-дисков CD-ROM
</FONT>
<H1>
<HR>
<OL>
<H5 ALIGN="center">
Аббревиатура CD-ROM (Compact Disc Read-Only Memory) переводится на русский язык как постоянное запоминающее устройство на основе компакт-диска.
</H5>
<IMG SRC="Fail11.jpg" align="center">
<H5 ALIGN="center">
Принцип действия этого устройства состоит в считывании числовых данных с помощью лазерного луча, отражающегося от поверхности диска.
Цифровая запись на компакт-диске отличается от записи на магнитных дисках очень высокой плотностью, и стандартный компакт-диск может хранить примерно 650 Мбайт данных.
Большие объемы данных характерны для мультимедийной информации (графика, музыка, видео), поэтому дисководы CD-ROM относят к аппаратным средствам мультимедиа.
Программные продукты, распространяемые на лазерных дисках, называют мультимедийными изданиями.
Сегодня мультимедийные издания завоевывают все более прочное место среди других традиционных видов изданий.
Так, например, существуют книги, альбомы, энциклопедии и даже периодические издания (электронные журналы), выпускаемые на CD-ROM.
Основным недостатком стандартных дисководов CD-ROM является невозможность записи данных, но параллельно с ними существуют и устройства однократной записи CD-R (Compact Disk Recorder), и устройства многократной записи CD-RW.
Основным параметром дисководов CD-ROM является скорость чтения данных.
В настоящее время наибольшее распространение имеют устройства чтения CD-ROM с производительностью 32х-50х. Современные образцы устройств однократной записи имеют производительность 4х-8х, а устройств многократной записи - до 4х.
</H5>
</OL>
<H2 ALIGN="center">
<======>
</H2>
<H2 ALIGN="center">
<|<A HREF="top.html">Подробнная информация</A>|>
</H2>
<H2 ALIGN="center">
<======>
</H2>
<body>
<H1 ALIGN="center">
<FONT COLOR="red">
Дополнительная информация по теме
</FONT>
<H1>
<HR>
<OL>
<ADRESS>
<A HREF="mailto:username@server.ru">Как устроены компьютерные сети</A>
</ADRESS>
<H5 ALIGN="left">
Описание различных видов компьютерных сетей, как они устроены и рассматриваются плюсы и минусы той или иной конфигурации сети
</H5>
<ADRESS>
<A HREF="mailto:username@server.ru">Какой компьютер купить для игр</A>
</ADRESS>
<H5 ALIGN="left">
В данной статье рассказывается об особенностях игровых компьютеров, помощь в выборе
</H5>
<ADRESS>
<A HREF="mailto:username@server.ru">Как влияет компьютер на здоровье человека</A>
</ADRESS>
<H5 ALIGN="left">
Описание основных фактором и мифов о том, как влияет компьютер на здоровье человека
</H5>
<ADRESS>
<A HREF="mailto:username@server.ru">Как защитить свой компьютер от вирусов</A>
</ADRESS>
<H5 ALIGN="left">
Статья, рассказывающая о современных методах защиты от вредоносных программ, различных способах ограждения от внедрения вирусов в персональный компьютер
</H5>
</OL>
<body background="ava.jpg">
<H3 ALIGN="center">
2017 год
</H3>